/** 東海道と中山道の共通区間のスポット一覧 */
const kusatsuToSanjyoSpots = [
  {
    name: "追分道標",
    kana: "おいわけみちしるべ",
    coordinate: [35.018102, 135.960927],
    icon: "monument",
    description:
      "「左 中仙道美のぢ」「右東海道いせみち」と彫られた道標があり、その上部に常夜燈の火袋があります。" +
      "文化13年 (1816) に建てられ、火袋の部分は何度も取り替えられたものの、道標部分は当時のものが残っているそうです。",
    url: "https://kanko-kusatsu.com/spot/oiwakemitishirube",
    pictures: [
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2023/07-16/PXL_20230716_032818617.webp",
        comment: "追分道標",
      },
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2023/07-16/PXL_20230716_032805097.webp",
        comment: "説明板",
      },
    ],
  },
  {
    name: "草津宿高札場跡",
    kana: "くさつしゅくこうさつばあと",
    coordinate: [35.018174, 135.960835],
    icon: "kosatsuba",
    description: "草津川ずい道の入口に高札場が再現されています。",
    pictures: [
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2023/07-16/PXL_20230716_032922664.webp",
        comment: "高札場",
      },
    ],
  },
  {
    name: "草津宿本陣 (田中七左衛門本陣)",
    kana: "くさつじゅくほんじん (たなかしちざえもんほんじん) ",
    coordinate: [35.0177048, 135.9603757],
    icon: "honjin",
    description:
      "草津宿に2軒あった本陣のうちの1軒で、建物が現存する本陣としては最大級です。国指定史跡になっています。" +
      "見学することができ、畳廊下、上段の間、庭園、住居部、台所など敷地内を隅々まで見て回れます。",
    url: "https://www.city.kusatsu.shiga.jp/kusatsujuku/honjin/",
    pictures: [
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2023/07-16/PXL_20230716_033139192.webp",
        comment: "草津宿本陣",
      },
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2023/07-16/PXL_20230716_033412676.webp",
        comment: "畳廊下",
      },
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2023/07-16/PXL_20230716_034112258.webp",
        comment: "庭園",
      },
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2023/07-16/PXL_20230716_034056403.webp",
        comment: "明治天皇草津行在所碑",
      },
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2023/07-16/PXL_20230716_033613438.webp",
        comment: "上段雪隠",
      },
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2023/07-16/PXL_20230716_034156964.webp",
        comment: "湯殿",
      },
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2023/07-16/PXL_20230716_034758830.webp",
        comment: "かまど",
      },
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2023/07-16/PXL_20230716_035511931.webp",
        comment: "井戸",
      },
    ],
  },
];

/** 東海道と中山道の共通区間のおすすめ歩行ルート */
const kusatsuToSanjyoRoute = [
  [34.9909978, 135.8363879], // 髭茶屋追分
  [34.991156, 135.8353633],
  [34.9911428, 135.833534],
  [34.9911384, 135.8323914],
  [34.9911824, 135.8312702],
  [34.9912527, 135.8311844],
  [34.9916262, 135.8309644],
  [34.9915384, 135.8308464],
  [34.9912879, 135.8302349],
  [34.9914241, 135.828191],
  [34.9914065, 135.8274668],
  [34.9915164, 135.8262599],
  [34.991468, 135.8255088],
  [34.9912659, 135.8237547],
  [34.9913274, 135.82111],
  [34.9912966, 135.8193934],
  [34.9912263, 135.8188999],
  [34.9912351, 135.8173174],
  [34.991178, 135.8151233],
  [34.9912395, 135.813396],
  [34.9911956, 135.8116043],
  [34.991323, 135.8103758],
  [34.9916306, 135.8097911],
  [34.9918152, 135.8077741],
  [34.9935511, 135.8057839],
  [34.9935028, 135.8050221],
  [34.9935335, 135.8043462],
  [34.9938763, 135.8029407],
  [34.994285, 135.8006823],
  [34.994496, 135.799647],
  [34.9947377, 135.7988745],
  [34.995098, 135.798322],
  [34.9957352, 135.7980269],
  [34.9962362, 135.7972813],
  [34.9966053, 135.7971096],
  [34.9971327, 135.7966],
  [34.9976556, 135.7959831],
  [34.998306, 135.7948726],
  [34.9987014, 135.7940143],
  [34.9992244, 135.7935208],
  [34.9996638, 135.7933706],
  [35.0005295, 135.7932365],
  [35.0015533, 135.7924908],
  [35.0030298, 135.7916594],
  [35.0037811, 135.7908601],
  [35.0042996, 135.7907099],
  [35.0054728, 135.7910371],
  [35.0060089, 135.7908922],
  [35.0072919, 135.7902539],
  [35.0084168, 135.7899535],
  [35.0091461, 135.7891595],
  [35.0093219, 135.7879579],
  [35.0095152, 135.7855546],
  [35.0092252, 135.782454],
  [35.009502, 135.7789564],
  [35.009379, 135.7753837],
  [35.0091066, 135.7722992],
  [35.0089836, 135.7712531], // 三条大橋西詰
];
