/** 中山道と川越街道の共通分のスポット一覧 */
const nihonbashiToHiraoSpots = [
  {
    name: "追分一里塚跡",
    kana: "おいわけいちりづかあと",
    coordinate: [35.7160864, 139.7584158],
    icon: "ichirizuka",
    description:
      "日本橋から1里 (約3.9km) の一里塚跡で、説明板があります。" +
      "ここは中山道と日光御成道 (旧岩槻街道) の追分 (分かれ道) にあたるため、追分一里塚と呼ばれててきたそうです。",
    pictures: [
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2022/12-04/IMG_20221204_061237.webp",
        comment: "説明板",
      },
    ],
  },
  {
    name: "徳川慶喜巣鴨屋敷跡地",
    coordinate: [35.732354, 139.739672],
    icon: "monument",
    description:
      "最後の将軍徳川慶喜が大政奉還後の明治30年 (1897) から4年間ここに屋敷を構えていたとのことです。" +
      "しかし現在の山手線が屋敷のすぐ横を通ることになり、騒音を嫌ってこの地を離れたそうです。",
    pictures: [
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2022/12-04/IMG_20221204_072034.webp",
        comment: "石碑・説明板",
      },
    ],
  },
  // 1. 板橋宿
  {
    name: "平尾追分",
    coordinate: [35.7496208, 139.7141165],
    icon: "guide",
    description:
      "中山道と川越街道の追分 (分かれ道) です。" +
      "中山道はここから北西方向に伸びており、ここから板橋宿の中宿エリアになります。",
    pictures: [
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2022/12-04/IMG_20221204_080216.webp",
        comment: "平尾追分",
      },
      {
        url: "https://kaidotrail.github.io/img/kagaorange/2022/12-04/IMG_20221204_080408.webp",
        comment: "観明寺の前に立つ「板橋宿今昔みちしるべ」案内板",
      },
    ],
  },
];

/** 中山道と川越街道の共通分のおすすめ歩行ルート */
const nihonbashiToHiraoRoute = [
  [35.684112, 139.774533], // 日本橋
  [35.684573, 139.774619],
  [35.695184, 139.770261],
  [35.695342, 139.770142],
  [35.69739, 139.769472],
  [35.698106, 139.768708],
  [35.698725, 139.768966],
  [35.699131, 139.768199],
  [35.699841, 139.76843],
  [35.700976, 139.766943],
  [35.701328, 139.766981],
  [35.701808, 139.766187],
  [35.701492, 139.766047],
  [35.704352, 139.761653],
  [35.704849, 139.761203],
  [35.705667, 139.760827],
  [35.709616, 139.760272],
  [35.716015, 139.758586], // 本郷追分
  [35.716, 139.757743],
  [35.716147, 139.757474],
  [35.718565, 139.755046],
  [35.719458, 139.754387],
  [35.723682, 139.752071],
  [35.724448, 139.750638],
  [35.725951, 139.748021],
  [35.728639, 139.743879],
  [35.731604, 139.740857],
  [35.734553, 139.737257], // 巣鴨駅
  [35.734812, 139.736546],
  [35.735362, 139.735486],
  [35.735782, 139.734785],
  [35.738025, 139.731557],
  [35.738116, 139.731433],
  [35.739987, 139.729345],
  [35.742264, 139.726369],
  [35.745697, 139.722197],
  [35.746241, 139.721325],
  [35.749664, 139.71416], // 平尾追分
];
